---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionLength
source: html/6dba04e6-ad68-05ed-8af5-7af002655bf0.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionLength Property

The extension length of the rail termination at the end or top.

## Syntax (C#)
```csharp
public double EndOrTopExtensionLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for endExtensionLength must be between 0 and 30000 feet.